Repository: AndreyErmoshin/Cip
Catalog: Cip.LabDemo/Resources/Cip.LabDemo.Strings.*.resx
Languages: ru_ru

# Caption_Error
source: Error
ru_ru: Ошибка

# Caption_IOError
source: IO Error
ru_ru: Ошибка Ввода\Вывода

# Caption_Warning
source: Warning
ru_ru: Предупреждение

# Cip_Name
source: Color Image Processing
ru_ru: Обработка Цветных Изображений

# Description_BlackAndWhiteImage
source: Black and white image
ru_ru: Чёрно белое изображение

# Description_ColorAdditionExample
source: Color addition example
ru_ru: Пример цветового дополнения

# Description_CorrectionResult
source: Correction result
ru_ru: Результат коррекции

# Description_DarkImage
source: Dark image
ru_ru: Тёмное изображение

# Description_DifferenceBetweenRgbHsi
source: Difference between methods in RGB and HSI colorspaces
ru_ru: Разница между методами в RGB и HSI пространствах

# Description_ExampleCutFromDip
source: Example from DIP book
ru_ru: Пример из книги Цифровая Обработка Изображений

# Description_HueComponent
source: Hue component
ru_ru: Компонента цветового тона

# Description_ImageAfterBloom
source: Image after bloom
ru_ru: Изображение после применения фильтра Bloom

# Description_ImageAfterBlur5x5
source: Image after smoothing with mask 5x5
ru_ru: Изображение после сглаживания маской 5x5

# Description_ImageAfterEqualization
source: Image after histogram equalization
ru_ru: Изображение после эквализации гистограммы

# Description_ImageAfterNormalization
source: Image after histogram normalization
ru_ru: Изображение после нормализации гистограммы

# Description_ImageAfterProcessing
source: Image after processing
ru_ru: Изображение после обработки

# Description_ImageAfterSepia
source: Image after Sepia filter
ru_ru: Изображение после фильтра Сепия

# Description_ImageAfterSharpening
source: Image after sharpening
ru_ru: Изображение после увеличения чёткости

# Description_ImageAfterThresholding
source: Image after thresholding
ru_ru: Изображение после пороговой обработки

# Description_LightImage
source: Light image
ru_ru: Светлое изображение

# Description_LowContrastImage
source: Low contrast image
ru_ru: Малоконтрастное изображение

# Description_Masks
source: Masks
ru_ru: Маски

# Description_Original
source: Original
ru_ru: Оригинал

# Description_UnderConstruction
source: Under construction...
ru_ru: Строящийся...

# Message_LoadFilePart1
source: Application can't LOAD
ru_ru: Приложение не может ЗАГРУЗИТЬ

# Message_LoadFilePart2
source: file, that should be in the directory
ru_ru: файл, который должен быть в директории

# Message_LoadFilePart3
source: of application
ru_ru: приложения

# Message_ReloadApplication
source: This action will reload application and all data will be lost!
ru_ru: Это действие перезагрузит приложение и все данные будут потеряны!

# Message_SaveFilePart1
source: Application can't SAVE
ru_ru: Приложение не может СОХРАНИТЬ

# Message_SaveFilePart2
source: file to this
ru_ru: файл в эту

# Message_SaveFilePart3
source: directory!
ru_ru: директорию!

# Message_SaveFunctionWarning
source: This save function only for Editor tab modifyed image! Save image?
ru_ru: Эта функция сохранения только для модифицированного изображения закладки Редактора! Сохранить изображение?

# Mode_Normal
source: Normal mode
ru_ru: Оригинальные пропорции

# Mode_Stretch
source: Stretch mode
ru_ru: Растянуть изображение

# Mode_Zoom
source: Zoom mode
ru_ru: Растянуть по ширине

# Open_Image
source: Open picture
ru_ru: Открыть изображение

# Save_Image
source: Save picture
ru_ru: Сохранить изображение
